In [1]:
import sqlite3

In [2]:
connection = sqlite3.connect('Example.db')
connection

In [3]:
cursor = connection.cursor()

In [6]:
cursor.execute('''

CREATE TABLE IF NOT EXISTS employee(
    Id INT PRIMARY KEY,
    Name TEXT NOT NULL,
    Age INT,
    Salary INT NOT NULL,
    Department TEXT NOT NULL
)
''')
connection.commit()

In [8]:
cursor.execute('select * from employee')

In [14]:
cursor.execute('''
INSERT INTO employee (Id,Name,Age,Salary,Department) VALUES (1,'Ayush',22,1500000,'Data Science')
''')

cursor.execute('''
INSERT INTO employee (Id,Name,Age,Salary,Department) VALUES (2,'Ankit',22,150000,'Science')
''')

cursor.execute('''
INSERT INTO employee (Id,Name,Age,Salary,Department) VALUES (3,'Amit',22,15000,'Data')
''')

cursor.execute('''
INSERT INTO employee (Id,Name,Age,Salary,Department) VALUES (4,'Aaniket',22,100000,'Data Science')
''')

connection.commit()

In [15]:
cursor.execute('SELECT * FROM employee')

rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Ayush', 22, 1500000, 'Data Science')
(2, 'Ankit', 22, 150000, 'Science')
(3, 'Amit', 22, 15000, 'Data')
(4, 'Aaniket', 22, 100000, 'Data Science')

### using where

In [20]:
cursor.execute('SELECT ID,NAME FROM EMPLOYEE WHERE department == "Data Science"')
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Ayush')
(4, 'Aaniket')

Update

In [23]:
cursor.execute('UPDATE EMPLOYEE SET AGE = 24 WHERE ID = 4')
# rows = cursor.fetchall()

# for row in rows:
#     print(row)
connection.commit()

In [25]:
cursor.execute('SELECT * FROM EMPLOYEE')
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Ayush', 22, 1500000, 'Data Science')
(2, 'Ankit', 22, 150000, 'Science')
(3, 'Amit', 22, 15000, 'Data')
(4, 'Aaniket', 24, 100000, 'Data Science')

### DELETE

In [27]:
cursor.execute('DELETE FROM EMPLOYEE WHERE ID = 2')
connection.commit()

In [28]:
cursor.execute('SELECT * FROM EMPLOYEE')
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Ayush', 22, 1500000, 'Data Science')
(3, 'Amit', 22, 15000, 'Data')
(4, 'Aaniket', 24, 100000, 'Data Science')